Revit 2024 API
ScheduleDefinition.HasEmbeddedSchedule Property
 Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasEmbeddedSchedule { get; }
Visual Basic
Public ReadOnly Property HasEmbeddedSchedule As Boolean
	Get
Visual C++
public:
property bool HasEmbeddedSchedule {
	bool get ();
}
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace